/**
 * Created by qian on 2017/6/21.
 * 行政区域
 */

const provinceData1 = ['山东省'];
const cityData = {
    山东省: ["枣庄市","济南市","青岛市","聊城市","德州市","东营市","淄博市","潍坊市","烟台市","威海市","日照市","临沂市","济宁市","泰安市","莱芜市","滨州市","菏泽市"],
};
const country = {
    枣庄市:["薛城区","市中区","峄城区","台儿庄区","山亭区","滕州市"],
    济南市:["市中区","历下区","槐荫区","天桥区","历城区","长清区","章丘市","平阴县","平阴镇","济阳县","济阳镇","商河县"],
    青岛市:["市南区","市北区","四方区","黄岛区","崂山区","城阳区","李沧区","胶州市","即墨市","平度市","胶南市","莱西市"],
    聊城市:["东昌府区","临清市","阳谷县","莘县","茌平县","东阿县","冠县","冠城镇","高唐县"],
    德州市:["德城区","乐陵市","禹城市","陵县","陵城镇","平原县","夏津县","夏津镇","武城县","武城镇","齐河县","晏城镇","临邑县","宁津县","宁津镇","庆云县","庆云镇"],
    东营市:["东营区","河口区","垦利县","垦利镇","利津县","利津镇","广饶县","广饶镇"],
    淄博市:["张店区","淄川区","博山区","临淄区","周村区","桓台县","索镇","高青县","田镇","沂源县","南麻镇"],
    潍坊市:["潍城区","寒亭区","坊子区","奎文区","安丘市","昌邑市","高密市","青州市","诸城市","寿光市","临朐县","昌乐县"],
    烟台市:["莱山区","芝罘区","福山区","牟平区","栖霞市","海阳市","龙口市","莱阳市","莱州市","蓬莱市","招远市","长岛县","南长山镇"],
    威海市:["环翠区","荣成市","乳山市","文登市"],
    日照市:["东港区","岚山区","五莲县","洪凝镇","莒县","城阳镇"],
    临沂市:["兰山区","罗庄区","河东区","郯城县","郯城镇","苍山县","卞庄镇","莒南县","十字路镇","沂水县","沂水镇","蒙阴县","蒙阴镇","平邑县","平邑镇","费县","费城镇","沂南县","界湖镇","临沭县","临沭镇"],
    济宁市:["市中区","任城区","曲阜市","兖州市","邹城市","微山县","鱼台县","谷亭镇","金乡县","金乡镇","嘉祥县","嘉祥镇","汶上县","汶上镇","泗水县","梁山县","梁山镇"],
    泰安市:["泰山区","岱岳区","新泰市","肥城市","宁阳县","宁阳镇","东平县","东平镇"],
    莱芜市:["莱城区","钢城区"],
    滨州市:["滨城区","惠民县","惠民镇","阳信县","阳信镇","无棣县","无棣镇","沾化县","富国镇","博兴县","博兴镇","邹平县"],
    菏泽市:["牡丹区","曹县","曹城镇","定陶县","定陶镇","成武县","成武镇","单县","单城镇","巨野县","巨野镇","郓城县","郓城镇","鄄城县","鄄城镇","东明县","城关镇"],
};
